Table of Contents
 Interface IIdeaTaper
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Defines haunches (variyng cross-sections) along the member.
One IIdeaTaper may be assigned to multiple Members. Sections of the member not covered by a span will use the member's cross-section.
public interface IIdeaTaper : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Spans
List of spans. Spans mut not overlap.
IEnumerable<IIdeaSpan> Spans { get; }
Property Value
IEnumerable<IIdeaSpan>
 Edit this page